    # bin - в двоичную (из 10ной)
    # oct - в восьмиричную (из 10ной)
    # hex - с шестнадцатиричную (из 10ной)

    # int() - перевод из любой другой системы счисления в 10

        # 1

# a = str(bin(4**2020 + 2**2017 - 15))[2::]
#
# print (a.count('1'))


        # 2  (14.7761)(перевод из двоичной в любую другую(в принте система счисления))

# num = 1011
#
# print (int(str(num), 5))

                        ## в одной СС ##

        # 3 (14.48378)

# a - 10
# b - 11
# c - 12
# d - 13
# e - 14
# f - 15
# g - 16
# h - 17
# i - 18

# alph = '0123456789abcdefghi'    # 19ричный алфавит
#
# for x in alph:
#     # print(int(x,19))       #вывод каждого символа алфавита
#
#     num = int('321' + x + '4', 19) + int('498' + x + '9', 19)   # из условия (перевод в 10ричную)
#     # print(num)      # числа в 10ричной системе
#
#     if num%23 == 0:
#         print(num//23)


        # 4 (14.48383)

# for x in range(9):
#     num = int('88' + str(x) + '4' + str(x), 9) + int('7' + str(x) + '344', 9)
#     if num % 67 == 0:
#         print(num//67)


        # 5 (14.48380)

# alph = '0123456789ab'
#
# for a in range(1,10000):
#     for x in alph:
#         m = int('49' + x + '26', 12)
#         n = int('49' + x + '70', 12)
#         if (m + a) % n == 0:
#             print(a)


                    ## в разных СС ##

                        #! алфавит перебора - всегджа алфавит наименьшей СС !#
                        # т.е если даны СС 15 и 12, то используем 12 СС #


        # 1 (14.48400)

# alph = '0123456789a'
#
# for x in alph:
#     num = int('95' + x + '2', 11) + int(x + '458', 12)
#     if num % 136 == 0:
#         print(num//136)


        # 2 (14.48403)

# alph = '0123456789ab'
#
# for x in alph:
#     num = int('2ab' + x, 12) + int(x + '8e', 17)
#     if num % 27 == 0:
#         print(num//27)

                        # c 2-мя переменными

        # 3 (14.48388)

# alph = '0123456789ab'
#
# for x in alph:
#     for y in alph:
#         num = int(x + '231' + y, 12) + int('78' + x + '98' + y, 14)
#         if num % 99 == 0:
#             print(num//99)



